ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_escss_config_regs.xml
<module id="ESCSS_CONFIG_REGS" HW_revision="" description="ESCSS CONFIG Registers">
	<register id="ESCSS_CONFIG_LOCK" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="EtherCATSS Configuration Lock">
		<bitfield id="LOCK_ENABLE" description="Locking writes to ECATSS" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="IO_CONFIG_ENABLE" description="Locking the IO Configuration" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_MISC_IO_CONFIG" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="RESET_IN, EEPROM IO connections select">
		<bitfield id="RESETIN_GPIO_EN" description="Enabled ResetIN from GPIO" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EEPROM_I2C_IO_EN" description="Enables the EEPROM I2C IOPAD connection" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_PHY_IO_CONFIG" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Control Register of ESCSS">
		<bitfield id="PHY_PORT_CNT" description="Number of PHY port counts" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="TX_CLK_AUTO_COMP" description="Selects TX_CLK IO to do Auto compensation" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_SYNC_IO_CONFIG" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="SYNC Signals IO configurations">
		<bitfield id="SYNC0_GPIO_EN" description="SYNC0 connection to OUT pad enabled" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SYNC1_GPIO_EN" description="SYNC1 connection to OUT pad enabled" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_LATCH_IO_CONFIG" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="LATCH inputs IO pad select">
		<bitfield id="LATCH0_GPIO_EN" description="LATCH0 connection to IN pad enabled" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LATCH1_GPIO_EN" description="LATCH1 connection to IN pad enabled" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WRITE_KEY" description="Key to enable writing lock" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPIN_SEL" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="GPIN Select between IO PAD and tieoff">
		<bitfield id="GPIN_SEL" description="Enable for GPI Connection to IO pad." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESCSS_GPOUT_SEL" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="GPOUT IO pad connect select">
		<bitfield id="GPOUT_SEL" description="GPO selection between register or GPIO pad." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ESCSS_LED_CONFIG" width="32" page="0" offset="0x24" instances="1" instaddr="4" internal="0" description="Selection of LED o/p connect to IO pad">
		<bitfield id="STATE" description="GPIO enable for STATE LED" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ERR" description="GPIO enable for ERR LED" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="RUN" description="GPIO enable for RUN LED" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="ESCSS_MISC_CONFIG" width="32" page="0" offset="0x28" instances="1" instaddr="4" internal="0" description="Miscelleneous Configuration">
		<bitfield id="TX0_SHIFT_CONFIG" description="TX Shift configuration for Port0" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="TX1_SHIFT_CONFIG" description="TX Shift configuration for Port1" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="EEPROM_SIZE" description="EEPROM Size bound select" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PDI_EMULATION" description="PDI Emulation enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PHY_ADDR" description="PHY Address Offset" begin="10" end="6" width="5" rwaccess="RW"/>
	</register>
</module>
